spec/vcr/gateway_create_payment_session/success.yml

---
http_interactions:
- request:
    method: post
    uri: https://checkout-test.adyen.com/v71/sessions
    body:
      encoding: UTF-8
      string: '{"amount":{"value":100,"currency":"USD"},"returnUrl":"https://localhost/order/R378452304","reference":"R378452304","countryCode":"US","lineItems":[{"amountExcludingTax":10,"amountIncludingTax":10,"description":"Product
        11971","id":1,"sku":"SKU-1","quantity":1}],"merchantAccount":"SpreeCommerceECOM","merchantOrderReference":"R378452304","expiresAt":"2025-07-02T21:38:12Z","allowedPaymentMethods":["blik","visa","mastercard"],"additionalData":{"spree_order_id":1},"shopperName":{"firstName":"John","lastName":"Doe"},"shopperEmail":"robt@goyettefahey.ca","shopperReference":"001","channel":"Web"}'
    headers:
      Content-Type:
      - application/json
      User-Agent:
      - adyen-ruby-api-library/10.3.0
      X-Api-Key:
      - secret
      Idempotency-Key:
      - 1cbde751-d0f2-43dd-b77b-e6bf824091ce
      Adyen-Library-Name:
      - adyen-ruby-api-library
      Adyen-Library-Version:
      - 10.3.0
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Wed, 02 Jul 2025 20:38:12 GMT
      Content-Type:
      - application/json;charset=UTF-8
      Content-Length:
      - '2617'
      Connection:
      - keep-alive
      Traceparent:
      - 00-924174b42c368f2fe35c8bc838a7f808-1380f5adb0be21d3-01
      X-Frame-Options:
      - SAMEORIGIN
      X-Content-Type-Options:
      - nosniff
      Cache-Control:
      - no-cache, no-store, private, must-revalidate, max-age=0
      Pragma:
      - no-cache
      Expires:
      - '0'
      Set-Cookie:
      - JSESSIONID=A8552348D38D6EF49969594616CE6B25; Path=/checkout; Secure; HttpOnly
      - __cf_bm=aY79giPoZsGhXoSAmyQVS.fqcdzH3DvXYYbX42.HCso-1751488692-1.0.1.1-l.mvmjwerG2z8i6bvUAfG.8j7Q.785bFX.Ed9bmpF6WDH3uK6JcRY9YwszbSn1PPIL2o9VsuaAC9ZoAtfEPcCfqBYu3z52CytMcFb6.SFp4;
        path=/; expires=Wed, 02-Jul-25 21:08:12 GMT; domain=.adyen.com; HttpOnly;
        Secure; SameSite=None
      - _cfuvid=ibEz2vupE5veFeP5ANNgpVd595X3A937VbH4dX3aEzc-1751488692905-0.0.1.1-604800000;
        path=/; domain=.adyen.com; HttpOnly; Secure; SameSite=None
      Idempotency-Key:
      - 1cbde751-d0f2-43dd-b77b-e6bf824091ce
      Pspreference:
      - DBCN3TQHVS3JHPT5
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      Cf-Cache-Status:
      - DYNAMIC
      Server:
      - cloudflare
      Cf-Ray:
      - 9590f2099e420287-WAW
    body:
      encoding: UTF-8
      string: '{"additionalData":{"spree_order_id":"1"},"allowedPaymentMethods":["blik","visa","mastercard"],"amount":{"currency":"USD","value":100},"channel":"Web","countryCode":"US","expiresAt":"2025-07-02T23:38:12+02:00","id":"CSC9E6046E3CF70774","lineItems":[{"amountExcludingTax":10,"amountIncludingTax":10,"description":"Product
        11971","id":"1","quantity":1,"sku":"SKU-1","taxAmount":0,"taxPercentage":0}],"merchantAccount":"SpreeCommerceECOM","merchantOrderReference":"R378452304","reference":"R378452304","returnUrl":"https:\/\/localhost\/order\/R378452304","shopperEmail":"robt@goyettefahey.ca","shopperLocale":"en-US","shopperName":{"firstName":"John","lastName":"Doe"},"shopperReference":"001","mode":"embedded","sessionData":"Ab02b4c0!BQABAgBClvGFDpR4GDHeAD3bhHMPgjZ5NMP4oviRy7B0\/QrMfiKNB0HKWzwCMFw8vxHXMMKhExMYa7PQEk8axpw02UgxTDtqwBMRSotBslTVEVhhpITDj2FqUp+zPQvsFT2vlXNBe4dawANNBuRZsQFgoT0A8sI5xUpThQSGQNX2Gwil6uEouxtzzVHOkOGLXL8OQ78XBflKjDemfq8Xi9c1S4ZxO9O1kPJilWgUZtSmdJCFyqIIhL1ZJ8wAgZjUEPyeZ12pZD7KhLiyavenx41XTb5ztRdIMkvCMUouXYjAHyvwP8bFoSOHlIuf+G+kVgM1b0U9My0QXBqmGPH2spgsr5Cf2HGd+8w8wvDs4dDxQxPoUgna2nbYzT4cgMCYGHuWs\/cbsJpmHs3\/BAD1NttdfIB\/m\/iEiWLXF+bHWp33l4CP4cUKBNBOvELnaypyjbIX+eY2jl4I4vnFfakJ74gxLlDyo3e4ckgllC03rCYFbuz\/pmmzKFpvZ9F96AD1zq99CTJrg27yFZTCC2zsshXUVs3\/Vz0D13hw+tkJpe5hthDDkdg4664mNV5x1cNgq\/8YSlCzYvrbuGPfROUllFrJyh4oIjOuO0LYaH+fSVjeb+aBrY5aJcTuL0ZujG6v8ByLGFP+yX+szAls5XSekHPlvWdSNheRxS9z2mLMEo77Wz0ejQx3t1TKPbFoyb\/8AXwASnsia2V5IjoiQUYwQUFBMTAzQ0E1MzdFQUVEODdDMjRERDUzOTA5QjgwQTc4QTkyM0UzODIzRDY4REFDQzk0QjlGRjgzMDVEQyJ9rXqvyPXS04VlyJMZGWAyPRBP09JrBhuWPxaUMfwoH1aH22J\/oMaSfLPljxy0SaRQOiJHUZeCvdUcbQTTYNed9H4wkkwETWU9I6uAbQ9+4ipB\/Vx8kK1XGZ4ZKFwnrkCipl3XHrUyV+MEcKD8Pgf3wapcaGBAwHK7pYcbC1pkJlHtAwYWaHR3X4UB4TSLX\/vlS1PWxST4zNJSCQJW1w0omCzCPE1SCaxqKtTx1mV4CmM1Plw5S1jOLPTJcX13JYJPC7Xl8M+HJTnr04NIn4xhxMIWyXahYRU14XkUuQCcJxIuCeO4n5Z\/K2ONfHIhEN0xMBjmLFKzFlKGHoID\/asWBnbdylU+ASy\/p2dPFgdcALJsW1gG7PmYksv8acBna\/xzAViYZo+EC12pgA2dlJylhmEjCSALmHA+8IWaNhgoIZO7Ry17qSxXo2DN4e2t4jKkI8AJQGEFp9WIXbhJM3eilhOzecXvM74kNKBTjIWvRyBw04YPn3KgMWdAt9qbHqrZCi2S+sHlblD1NjVU8jK2quBLx04lFNpCTyHu+8YZZoJza7hsGz+5\/cd56mGr47Bw+BZxSZaJRRkfgGfb6osxU3T75W7l1lIALVDPNY+JZjc4RiFe9BKV9r4eGAZj1zURXtPXNq\/iaonaYas9xEULAwgHi+afjU\/XYCJu26MvWXUALEeoAyNBiX1UdXftl8Yvn9cUOxWSaNtNtOZgThNuDhdgGdg\/mqEBpYCQDwJxcSk2OFa9rf0V3oFNYuz7l+a9tFsIWctVXcnqx4ZrzA3xpPfzErU01F02IzON4a2IcdaVglTZDEtTZ2r3\/m6nTs5sLZ4tnMXOM+X0lAs7RhnQjtaLlInGvVmSFyElb6JY9U+51M0nXDCAXybS6zHhrq\/Z4T0W0ZudRt0K02yIJZHeNzJ\/V9MwLRwNx4QA+ETnq52xjdUr3i4juec1AjlZeWanWvTQcsp2ENzhDl2HuB7igNGESMqn47vZg7OzmeZyaS0vP1oYv5Etw7oz96TXg+bwjxzro5yNWNSze3qfRsQKq9aVNg=="}'
  recorded_at: Wed, 02 Jul 2025 20:38:12 GMT
recorded_with: VCR 6.3.1
